//*********************************************************************
//
// 評価するメンバーの名前のリスト
//
// この部分を変更してください。名前の追加・削除も可能です。
// 名前を引用符(")で括り、コンマ(,)で区切って下さい。
// 但し、リストの最後にはコンマを入れてはいけません。
//
//********************************************************************
var Names = new Array(

"譜久村聖",
"生田衣梨奈",
"飯窪春菜",
"石田亜佑美",
"佐藤優樹",
"小田さくら",
"野中美希",
"牧野真莉愛",
"羽賀朱音",
"加賀楓",//10
"横山玲奈",
"森戸知沙希",

"和田彩花",

"中西香菜",
"竹内朱莉",
"勝田里奈",

"室田瑞希",
"佐々木莉佳子",

"上國料萌衣",

"笠原桃奈",//20
"船木結",
"川村文乃",

"宮崎由加",
"金澤朋子", 
"高木紗友希",
"宮本佳林",
"植村あかり",
"梁川奈々美",
"段原瑠々",

"稲場愛香",//30

"山木梨沙",
"小関舞",

"広瀬彩海",
"野村みな美",
"浜浦彩乃",
"和田桜子",
"井上玲音",

"山岸理子",
"小片リサ",
"新沼希空",//40
"谷本安美",
"岸本ゆめの",
"浅倉樹々",
"小野瑞歩",
"小野田紗栞",
"秋山眞緒",

"一岡伶奈",
"島倉りか",
"西田汐里",
"江口紗耶",//50

"高瀬くるみ",
"前田こころ",
"山﨑夢羽",
"岡村美波",
"清野桃々姫",

"光井愛佳",
"鞘師里保",

//"堀江葵月",
//"金津美月",

"野口胡桃",
"小野琴己",
"児玉咲子",//60
"米村姫良々",

"橋迫鈴",

"日比麻里那",
"土居麗菜",
"松永里愛",
"山田苺",
"中山夏月姫",

"為永幸音",
"窪田七海",
"出頭杏奈",//70
"金光留々",
"松原ユリヤ",

"太田遥香",
"佐藤光",
"石栗奏美",
"河野みのり",
"工藤由愛",
"山﨑愛生"//78
);

// 短い表記用（名字やニックネームなど）
var F_Names = new Array(
"譜久村", //モーニング娘。
"生田",
"飯窪",
"石田",
"佐藤ま",
"小田",
"野中",
"牧野",
"羽賀",
"加賀",
"横山",
"森戸",

"和田あ", //アンジュルム
"中西",
"竹内",
"勝田",
"室田",
"佐々木",
"上國料",
"笠原",
"船木",
"川村",

"宮崎", //Juice=Juice
"金澤",
"高木",
"宮本",
"植村",
"梁川",
"段原",
"稲場",

"山木", //カントリーガールズ
"小関",

"広瀬",//こぶし
"野村",
"浜浦",
"和田さ",
"井上",

"山岸",//つばき
"小片",
"新沼",
"谷本",
"岸本",
"朝倉",
"小野み",
"小野田",
"秋山",

"一岡",
"島倉",
"西田",
"江口",

"高瀬",
"前田",
"山﨑ゆ",
"岡村",
"清野",

"光井",//ソロ
"鞘師",

"野口",//ハロプロ研修生
"小野こ",
"児玉",
"米村",

"橋迫",

"日比",
"土居",
"松永",
"山田",//20
"中山",

"為永",
"窪田",
"出頭",
"金光",
"松原",

"太田",
"佐藤ひ",
"石栗",
"河野",
"工藤",
"山﨑あ"
);

// グループの人数
var G_Peo = new Array(
12,10,8,2,5,9,4,5,2,15,6
);

// グループの色
var G_Color = new Array(
"#E5457D","#FF85AD","#FF9900","#56BF00","#F72F1F","#787FDC","#0075C2","#3096D0","#3385D6","#33D6AD","#1CBDBA"
);


// 数値をグループ名に変換+++++++++++++++++++++++++++++++++++++++++
function toNameFace(n){
	var str = Names[n];
	var temp = "";

	//顔文字を追加する場合は以下のコメントアウトを外す
	//namMemberのインデックスと矛盾しないように注意

	str += "<br>";
	switch(n) {
		//case -1 はサンプルなので削除すること
		case 0: str+="モーニング娘。'18[9期]9代目リーダー<br>ハロプロサブリーダー<br>(7代目サブリーダー,ハロプロエッグ[4期])";break;
		case 1: str+="モーニング娘。'18[9期]8代目サブリーダー";break;
		case 2: str+="モーニング娘。'18[10期]7,8代目サブリーダー";break;
		case 3: str+="モーニング娘。'18[10期]";break;
		case 4: str+="モーニング娘。'18[10期]";break;
		case 5: str+="モーニング娘。'18[11期]<br>(ハロプロ研修生[13期])";break;
		case 6: str+="モーニング娘。'18[12期]";break;
		case 7: str+="モーニング娘。'18[12期]<br>(ハロプロ研修生[17期])";break;
		case 8: str+="モーニング娘。'18[12期]<br>(ハロプロ研修生[20期])";break;
		case 9: str+="モーニング娘。'18[13期]<br>(ハロプロ研修生[17期])";break;
		case 10: str+="モーニング娘。'18[13期]<br>(ハロプロ研修生[26期])";break;
		case 11: str+="モーニング娘。'18[14期] 兼 カントリー・ガールズ";break;
		case 12: str+="アンジュルム リーダー,ハロプロリーダー<br>(スマイレージリーダー,ハロプロエッグ[1期])";break;
		case 13: str+="アンジュルム<br>(スマイレージ[2期])";break;
		case 14: str+="アンジュルム<br>(スマイレージ[2期],ハロプロエッグ[4期])";break;
		case 15: str+="アンジュルム<br>(スマイレージ[2期],ハロプロエッグ[7期])";break;
		case 16: str+="アンジュルム<br>(スマイレージ[3期],ハロプロ研修生[15期])";break;
		case 17: str+="アンジュルム<br>(スマイレージ[3期],ハロプロ研修生[18期])";break;
		case 18: str+="アンジュルム[2期]";break;
		case 19: str+="アンジュルム[3期]<br>(ハロプロ研修生[24期])";break;
		case 20: str+="アンジュルム[4期] 兼 カントリー・ガールズ[2期]<br>(ハロプロ研修生[20期])";break;
		case 21: str+="アンジュルム[4期]<br>(ハロプロ研修生[26期])";break;
		case 22: str+="Juice=Juice リーダー";break;
		case 23: str+="Juice=Juice サブリーダー<br>(ハロプロ研修生[17期])";break;
		case 24: str+="Juice=Juice<br>(ハロプロ研修生[8期])";break;
		case 25: str+="Juice=Juice センター<br>(ハロプロ研修生[5期])";break;
		case 26: str+="Juice=Juice<br>(ハロプロ研修生[14期])";break;
		case 27: str+="Juice=Juice[2期] 兼 カントリー・ガールズ[2期]<br>(ハロプロ研修生[24期])";break;
		case 28: str+="Juice=Juice[2期]<br>(ハロプロ研修生[20期])";break;
		case 29: str+="Juice=Juice[3期]<br>(カントリー・ガールズ)";break;
		case 30: str+="カントリー・ガールズ<br>(ハロプロ研修生[20期])";break;
		case 31: str+="カントリー・ガールズ";break;
		case 32: str+="こぶしファクトリー リーダー<br>(ハロプロ研修生[22期])";break;
		case 33: str+="こぶしファクトリー<br>(ハロプロ研修生[17期])";break;
		case 34: str+="こぶしファクトリー<br>(ハロプロ研修生[11期])";break;
		case 35: str+="こぶしファクトリー<br>(ハロプロ研修生[17期])";break;
		case 36: str+="こぶしファクトリー<br>(ハロプロ研修生[22期])";break;
		case 37: str+="つばきファクトリー リーダー<br>(ハロプロ研修生[16期])";break;
		case 38: str+="つばきファクトリー サブリーダー<br>(ハロプロ研修生[22期])";break;
		case 39: str+="つばきファクトリー<br>(ハロプロ研修生[20期])";break;
		case 40: str+="つばきファクトリー<br>(ハロプロ研修生[22期])";break;
		case 41: str+="つばきファクトリー<br>(ハロプロ研修生[17期])";break;
		case 42: str+="つばきファクトリー<br>(ハロプロ研修生[22期])";break;
		case 43: str+="つばきファクトリー[2期]<br>(ハロプロ研修生[22期])";break;
		case 44: str+="つばきファクトリー[2期]<br>(ハロプロ研修生[24期])";break;
		case 45: str+="つばきファクトリー[2期]<br>(ハロプロ研修生[24期])";break;
		case 46: str+="[新グループ１]リーダー<br>ハロプロ研修生[17期])";break;
		case 47: str+="[新グループ１]<br>(ハロプロ研修生[27期])";break;
		case 48: str+="[新グループ１]<br>(ハロプロ研修生[26期])";break;
		case 49: str+="[新グループ１]<br>(ハロプロ研修生[27期])";break;
		case 50: str+="[新グループ２]<br>(ハロプロ研修生[23期])";break;
		case 51: str+="[新グループ２]<br>(ハロプロ研修生[24期])";break;
		case 52: str+="[新グループ２]<br>(ハロプロ研修生[26期])";break;
		case 53: str+="[新グループ２]<br>(ハロプロ研修生[27期])";break;
		case 54: str+="[新グループ２]<br>(ハロプロ研修生[25期])";break;
		case 55: str+="ソロ<br>(モーニング娘。[8期])";break;
		case 56: str+="ソロ<br>(モーニング娘。[9期])";break;
		case 57: str+="ハロプロ研修生[25期]";break;
		case 58: str+="ハロプロ研修生[25期]";break;
		case 59: str+="ハロプロ研修生[25期]";break;
		case 60: str+="ハロプロ研修生[25期]";break;
		case 61: str+="ハロプロ研修生[26期]";break;
		case 62: str+="ハロプロ研修生[27期]";break;
		case 63: str+="ハロプロ研修生[27期]";break;
		case 64: str+="ハロプロ研修生[27期]";break;
		case 65: str+="ハロプロ研修生[27期]";break;
		case 66: str+="ハロプロ研修生[27期]";break;
		case 67: str+="ハロプロ研修生[28期]";break;
		case 68: str+="ハロプロ研修生[28期]";break;
		case 69: str+="ハロプロ研修生[28期]";break;
		case 70: str+="ハロプロ研修生[28期]";break;
		case 71: str+="ハロプロ研修生[28期]";break;
		case 72: str+="ハロプロ研修生北海道[1期]";break;
		case 73: str+="ハロプロ研修生北海道[1期]";break;
		case 74: str+="ハロプロ研修生北海道[1期]";break;
		case 75: str+="ハロプロ研修生北海道[1期]";break;
		case 76: str+="ハロプロ研修生北海道[1期]";break;
		case 77: str+="ハロプロ研修生北海道[1期]";break;
		default: str+=""+n;
	}
	temp = "00"+String(n+1);
	temp = (temp.length==4) ? temp.substr(1,3) : temp.substr(0,3);
	str = "<img src=\"./"+temp+".jpg?20180926\" width=\"280\"><br>"+str;

	return str;
}

// 数値をグループ名に変換しません+++++++++++++++++++++++++++++++++++++++++
function toNameFace0(n){
	var str = Names[n];

	//顔文字を追加する場合は以下のコメントアウトを外す
	//namMemberのインデックスと矛盾しないように注意

//	str += "<br>────<br>";
//	switch(n) {
		//case -1 はサンプルなので削除すること
//		case -1: str+="モーニング娘。[５期]";break;
//		default: str+=""+n;
//	}

	return str;
}

// 名字のみ+++++++++++++++++++++++++++++++++++++++++
function toNameFace4(n){
	var str = F_Names[n];

	//顔文字を追加する場合は以下のコメントアウトを外す
	//namMemberのインデックスと矛盾しないように注意

//	str += "<br>────<br>";
//	switch(n) {
		//case -1 はサンプルなので削除すること
//		case -1: str+="モーニング娘。[５期]";break;
//		default: str+=""+n;
//	}

	return str;
}

// 画像と名前+++++++++++++++++++++++++++++++++++++++++
function toNameFace1(n){
	var str = Names[n];
	var temp = "";

	temp = "00"+String(n+1);
	temp = (temp.length==4) ? temp.substr(1,3) : temp.substr(0,3);
	str = "<img src=\"./"+temp+".jpg?20180926\"><br>"+str;

	return str;
}

// 画像と名前 その２+++++++++++++++++++++++++++++++++++++++++
function toNameFace2(n,w){
	var str = Names[n];
	var temp = "";

	temp = "00"+String(n+1);
	temp = (temp.length==4) ? temp.substr(1,3) : temp.substr(0,3);
	str = "<img style=\"width:"+w+"px;\" src=\"./"+temp+".jpg?20180926\"><br>"+str;

	return str;
}

// 画像と名前 その３+++++++++++++++++++++++++++++++++++++++++
function toNameFace3(n,w){
	var str = F_Names[n];
	var temp = "";

	temp = "00"+String(n+1);
	temp = (temp.length==4) ? temp.substr(1,3) : temp.substr(0,3);
	str = "<img style=\"width:"+w+"px;\" src=\"./"+temp+".jpg?20180926\"><br>"+str;

	return str;
}

// IDと得点を関連付けるオブジェクトの定義 ++++++++++++++++++++++++++++
function Person(id, score){
	this.id 	 = id;
	this.score = score;
	this.rank  = 0;
}